let message; // создает переменную message
message='Hello'; // поместили в переменную message n'Hello' при помощи оператора присваивания '='
alert('message'); // показывает содержимое переменной

// let message = 'hello'; // для краткости

// Имя переменной должно содержать только буквы, цифры или символы $ и _.
// Первый символ не должен быть цифрой.
// Переменные с именами apple и APPLE – это две разные переменные.


// Чтобы объявить константную, то есть, неизменяемую переменную, используйте const вместо let:
const myBirthday = '18.04.1982';
// константу нельзя перезаписать



