//Иногда нам нужно выполнить различные действия в зависимости от условий.

//Для этого мы можем использовать инструкцию if и условный оператор ?, который также называют оператором «вопросительный знак».

//Инструкция «if»
//Инструкция if(...) вычисляет условие в скобках и, если результат true, то выполняет блок кода.

//Например:

let b=4;
c=5;
if (c===b) {
	console.log("true");
}
else {
	console.log("false");
}

//let result = условие ? значение1 : значение2;

let age=12
sravn = (age > 18) ? true : false;
console.log(sravn);

