//УСЛОВИЕ:
//1)Создайте переменную для названия нашей планеты. Как бы вы её назвали?
//2)Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

let Planet = 'Земля';
let UserName = 'Рома';
console.log( `${Planet}` );
console.log( `${UserName}` );


//Решение:
let ourPlanetName = "Земля"; 
//Обратите внимание, мы могли бы использовать короткое имя planet, но тогда будет непонятно, о какой планете мы говорим. Лучше описать содержимое переменной подробнее, по крайней мере, до тех пор, пока имя переменной неСтанетСлишкомДлинным.
let currentUserName = "Джон";
//Опять же, мы могли бы укоротить название до userName, если мы точно знаем, что это текущий пользователь.